vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE315_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MCXE315_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MCXE315</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.09.00-pvw1" date="2025-07-14">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00-pvw1</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MCXE315" Dvendor="NXP:11">
      <description>MCXE31x</description>
      <device Dname="MCXE315">
        <processor Dcore="Cortex-M7" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MCXE315/iar/MCXE315_flash.icf"/>
        </environment>
        <sequences>
          <!-- The default implementation of ResetHardwareDeassert -->
          <sequence name="ResetHardwareDeassert_Default">
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;
              // Assert nRESET line and check if nRESET is readable
              canReadPins = (DAP_SWJ_Pins(nReset, nReset, 0) != 0xFFFFFFFF);
            </block>
            <!-- Wait max. 1s for nRESET to recover from reset if readable-->
            <control if="canReadPins" while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control if="!canReadPins" while="1" timeout="100000"/>
          </sequence>
          <sequence name="EnableM7Debug">
            <block info="Enable M7 cores debugging in SDA_AP">
              __var ap = __ap;                                  // Save current
              __ap = 7;                                         // Select SDA_AP
              WriteAP(0x80, 0x300000F0);                        // Enable M7 Debug in SDA_AP.DBGENCTRL
              __ap = ap;                                        // Restore AP
            </block>
          </sequence>
          <sequence name="FunctionalReset">
            <block info="Initiate functional reset">
              __var ap = __ap;                                  // Save current
              __ap = 6;                                         // Select MDM_AP
              WriteAP(0x04, 0x00400B00);                        // Assert RSTRELCM7/RSTRELTLn, CMnDBGREQ (MDMAPCTL)
              WriteAP(0x04, 0x00400B20);                        // Assert RSTRELCM7/RSTRELTLn, CMnDBGREQ and SYSFUNCRST (MDMAPCTL)
              WriteAP(0x04, 0x00400B00);                        // Assert RSTRELCM7/RSTRELTLn, CMnDBGREQ (MDMAPCTL)
              WriteAP(0x04, 0x00400000);                        // Assert RSTRELCM7/RSTRELTLn (MDMAPCTL)
              __ap = ap;                                        // Restore AP
            </block>
          </sequence>
          <sequence name="DebugFromFirstInstruction">
            <block>__var ap = __ap;                                  // Save current AP</block>
            <block>Sequence("EnableM7Debug");</block>
            <block>
              __ap = 6;                                         // set MDM-AP
              WriteAP(0x04, 0x00430000);                        // MDMAPCTL: Bits 16 and 17 CM7_x_CORE_ACCESS
            </block>
            <block>
              __ap = 7;                                         // SDA_AP;
              WriteAP(0x90, 0x00000000);                        // SDAAPRSTCTRL: Ensure M7s are held in reset
            </block>
          </sequence>
          <sequence name="DebugEnablement">
            <block>Sequence("EnableM7Debug");                        // Enable M7 debugging</block>
            <control if="DoRAMInitialize">
              <block>
                Sequence("EnablePeripheralClocks");             // Enable peripheral clocks
                Sequence("RAMInitialize");                      // Do RAM Initialize
              </block>
            </control>
          </sequence>
          <!-- Default sequence overrides -->
          <sequence name="ResetHardwareDeassert">
            <block>
              __var ap = __ap;                                  // Save current AP
              __var sdaaprstctrl_val;
            </block>
            <control if="ap == 4">
              <block>
                sdaaprstctrl_val = 0x02000000;                  // release CM7_0 from reset (RSTRELTLCM70 = 1)
              </block>
            </control>
            <control if="(__connection &amp; 0x00010000)">
              <block>
                __errorcontrol = 1;
                __ap = 7;                                       // __ap = SDA_AP;
                WriteAP(0x90, sdaaprstctrl_val);                // SDAAPRSTCTRL: Release M7_0 from reset
                __ap = ap;
                __errorcontrol = 0;
              </block>
              <block>
                //DAP_Delay(1000000);
                __errorcontrol = 1;
                Sequence("DebugEnablement");                    // Call DebugEnablement
                __errorcontrol = 0;
              </block>
            </control>
            <control if="(__connection &amp; 0x00010000) == 0x00000000" info="connect normal">
              <block>Sequence("ResetHardwareDeassert_Default");</block>
            </control>
          </sequence>
          <sequence name="DebugDeviceUnlock">
            <control if="(__connection &amp; 0x00010000)" info="connect under reset">
              <block>
                Sequence("DebugFromFirstInstruction");
                Sequence("ResetHardwareDeassert_Default");
              </block>
            </control>
            <control if="(__connection &amp; 0x00010000) == 0x00000000" info="connect normal">
              <block>Sequence("DebugEnablement");                    // Call DebugEnablement</block>
            </control>
          </sequence>
          <sequence name="ResetSystem">
            <block>Sequence("FunctionalReset");                      // Call FunctionalReset</block>
          </sequence>
          <!-- Device specific configuration. -->
          <sequence name="EnablePeripheralClocks">
            <block info="Enable peripheral clocks">
              // partition 0
              Write32(0x402DC134,0x0000F7DF);                   // Enable clock for block 1 in partition 0 (MC_ME.PRTN0_COFB1_CLKEN)
              Write32(0x402DC100,0x00000001);                   // Enable clock to IPs (MC_ME.PRTN0_PCONF)
              Write32(0x402DC104,0x00000001);                   // Trigger the hardware process (MC_ME.PRTN0_PUPD)
              Write32(0x402DC000,0x00005AF0);                   // Start the hardware process; key '5AF0' (MC_ME.MC_ME_CTL_KEY
              Write32(0x402DC000,0x0000A50F);                   //                             key 'A50F' (MC_ME.MC_ME_CTL_KEY
              // partition 1
              Write32(0x402DC330,0xB1E0FFF8);                   // Enable clock for block 0 in partition 1 (MC_ME.PRTN1_COFB0_CLKEN)
              Write32(0x402DC334,0x812AA407);                   // Enable clock for block 1 in partition 1 (MC_ME.PRTN1_COFB1_CLKEN)
              Write32(0x402DC338,0xBBF3FE7E);                   // Enable clock for block 2 in partition 1 (MC_ME.PRTN1_COFB2_CLKEN)
              Write32(0x402DC33C,0x00000141);                   // Enable clock for block 3 in partition 1 (MC_ME.PRTN1_COFB3_CLKEN)
              Write32(0x402DC300,0x00000001);                   // Enable clock to IPs (MC_ME.PRTN1_PCONF)
              Write32(0x402DC304,0x00000001);                   // Trigger the hardware process (MC_ME.PRTN1_PUPD)
              Write32(0x402DC000,0x00005AF0);                   // Start the hardware process; key '5AF0' (MC_ME.MC_ME_CTL_KEY
              Write32(0x402DC000,0x0000A50F);                   //                             key 'A50F' (MC_ME.MC_ME_CTL_KEY
            </block>
          </sequence>
          <sequence name="RAMInitialize">
            <block>
              __var TCD_B0 = 0x40210000;                        // TCD Base Address; TCD0 = 0x40210000, TCD1 = 0x40214000
              __var CHCFG0 =       0x03;                        // CH0 = 3, CH1 = 2, CH2 = 1, CH3 = 0
              __var TCD_B1 = 0x40214000;                        // TCD Base Address; TCD0 = 0x40210000, TCD1 = 0x40214000
              __var CHCFG1 =       0x02;                        // CH0 = 3, CH1 = 2, CH2 = 1, CH3 = 0
            </block>
            <block info="Initialize SRAM via DMA">
              // SRAM: 2 x 160kB @ 0x20400000
              Write8(0x40280000 + CHCFG0, 0x80);                // Enable DMA CH0 (DMAMUX_0 register CHCFG0)
              Write32(TCD_B0 + 0x020, 0x00400000);              // Source address '0x00400000' (DMA TCD register TCD0_SADDR)
              Write32(TCD_B0 + 0x024, 0x03030000);              // Offset '0' and attributes SSIZE, DSIZE '64bit' (DMA TCD register TCD0_SOFF, TCD0_ATTR)
              Write32(TCD_B0 + 0x028, RAMInitializeSRAMSize);   // Transfer size Nbytes '320Kb' (DMA TCD register TCD0_NBYTES_MLOFFNO)
              Write32(TCD_B0 + 0x02C, 0x00000000);              // Last source address adjustment '0' (DMA TCD register TCD0_SLAST_SDA)
              Write32(TCD_B0 + 0x030, 0x20400000);              // Destination address '0x20400000' (DMA TCD register TCD0_DADDR)
              Write32(TCD_B0 + 0x034, 0x00010008);              // Destination signed offset '8', Current Major Iteration Count '1' (DMA TCD register TCD0_DOFF, TCD0_CITER_ELINKNO)
              Write32(TCD_B0 + 0x038, 0xFFFB0000);              // Last destination address adjustment -NBYTES '0xFFFB0000' (DMA TCD register TCD0_DLAST_SGA)
              Write32(TCD_B0 + 0x03C, 0x00000001);              // Start DMA transfer (DMA TCD register TCD0_CSR)
            </block>
            <control while="(Read32(TCD_B0 + 0x000) &amp; 0x80000000)" timeout="1000000" info="Poll DMA is ACTIVE"/>
            <block info="Initialize DTCM via DMA">
              // DTCM: 1 x 128kB @ 0x20000000 (0x21000000 backdoor)
              Write8(0x40280000 + CHCFG0, 0x80);                // Enable DMA CH0 (DMAMUX_0 register CHCFG0)
              Write32(TCD_B0 + 0x020, 0x00400000);              // Source address '0x00400000' (DMA TCD register TCD0_SADDR)
              Write32(TCD_B0 + 0x024, 0x03030000);              // Offset '0' and attributes SSIZE, DSIZE '64bit' (DMA TCD register TCD0_SOFF, TCD0_ATTR)
              Write32(TCD_B0 + 0x028, RAMInitializeDTCMSize);   // Transfer size Nbytes '128Kb' (DMA TCD register TCD0_NBYTES_MLOFFNO)
              Write32(TCD_B0 + 0x02C, 0x00000000);              // Last source address adjustment '0' (DMA TCD register TCD0_SLAST_SDA)
              Write32(TCD_B0 + 0x030, 0x21000000);              // Destination address '0x20000000' (DMA TCD register TCD0_DADDR)
              Write32(TCD_B0 + 0x034, 0x00010008);              // Destination signed offset '8', Current Major Iteration Count '1' (DMA TCD register TCD0_DOFF, TCD0_CITER_ELINKNO)
              Write32(TCD_B0 + 0x038, 0xFFFF0000);              // Last destination address adjustment -NBYTES '0xFFFF0000' (DMA TCD register TCD0_DLAST_SGA)
              Write32(TCD_B0 + 0x03C, 0x00000001);              // Start DMA transfer (DMA TCD register TCD0_CSR)
            </block>
            <control while="(Read32(TCD_B0 + 0x000) &amp; 0x80000000)" timeout="1000000" info="Poll DMA is ACTIVE"/>
          </sequence>
        </sequences>
        <debugvars configfile="devices/MCXE315/arm/MCXE31x.dbgconf">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DoRAMInitialize = 1;                            // Enabled
          __var RAMInitializeSRAMSize = 0x00004000;             // 16KB
          __var RAMInitializeDTCMSize = 0x00010000;             // 64KB
        </debugvars>
        <memory name="DATA_FLASH" start="0x10000000" size="0x010000" access="rw" default="1"/>
        <memory name="DTCM" start="0x20000000" size="0x010000" access="rw" default="1"/>
        <memory name="ITCM" start="0x00000000" size="0x8000" access="rw" default="1"/>
        <memory name="PROGRAM_FLASH" start="0x00400000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x20400000" size="0x4000" access="rw" default="1"/>
        <algorithm name="devices/MCXE315/arm/MCXE31x_Code.FLM" start="0x00400000" size="0x00080000" RAMstart="0x20400000" RAMsize="0x00004000" default="1"/>
        <algorithm name="devices/MCXE315/arm/MCXE31x_Data.FLM" start="0x10000000" size="0x00010000" RAMstart="0x20400000" RAMsize="0x00004000" default="1"/>
        <debug svd="devices/MCXE315/MCXE315.xml" __dp="0" __ap="4"/>
        <variant Dvariant="MCXE315MPA">
          <compile header="devices/MCXE315/fsl_device_registers.h" define="CPU_MCXE315MPA"/>
        </variant>
        <variant Dvariant="MCXE315MLF">
          <compile header="devices/MCXE315/fsl_device_registers.h" define="CPU_MCXE315MLF"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MCXE315.internal_condition">
      <accept Dname="MCXE315MLF" Dvendor="NXP:11"/>
      <accept Dname="MCXE315MPA" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MCXE315.internal_condition"/>
    </condition>
