vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE315_DFP.pdsc
    <condition id="allOf.driver.common, driver.lpspi, device=MCXE315.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
    <condition id="component.lpuart_adapter.condition_id">
      <require condition="allOf.anyOf=driver.lpuart, device=MCXE315.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpuart, device=MCXE315.internal_condition">
      <require condition="anyOf.driver.lpuart.internal_condition"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MCXE31B.internal_condition">
      <accept Dname="MCXE31BMPB" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MCXE316.internal_condition">
      <accept Dname="MCXE316MLF" Dvendor="NXP:11"/>
      <accept Dname="MCXE316MPA" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MCXE317.internal_condition">
      <accept Dname="MCXE317MPA" Dvendor="NXP:11"/>
      <accept Dname="MCXE317MPB" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.mcux-edgelock.ele_hseb.condition_id">
      <require condition="allOf.board=frdmmcxe31b, device=MCXE315.internal_condition"/>
    </condition>
    <condition id="allOf.board=frdmmcxe31b, device=MCXE315.internal_condition">
      <require condition="board.frdmmcxe31b.internal_condition"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
    <condition id="board.frdmmcxe31b.internal_condition">
      <accept condition="device.MCXE31B.internal_condition"/>
      <accept condition="device.MCXE315.internal_condition"/>
      <accept condition="device.MCXE316.internal_condition"/>
      <accept condition="device.MCXE317.internal_condition"/>
    </condition>
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, device=MCXE315.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, device=MCXE315.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7.internal_condition"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
    </condition>
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, driver.flash_c40, device=MCXE315.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, driver.flash_c40, device=MCXE315.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7, driver.flash_c40.internal_condition"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.flash_c40.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="flash_c40"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MCXE315.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MCXE315.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MCXE315.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MCXE315.internal_condition"/>
    </condition>
    <condition id="component.pit_adapter.condition_id">
      <require condition="allOf.driver.pit, device=MCXE315.internal_condition"/>
    </condition>
    <condition id="allOf.driver.pit, device=MCXE315.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MCXE315.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=component.software_rng_adapter, device=MCXE315.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.software_rng_adapter, device=MCXE315.internal_condition">
      <require condition="anyOf.component.software_rng_adapter.internal_condition"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
    <condition id="anyOf.component.software_rng_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MCXE315.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXE315.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXE315.internal_condition">
      <require condition="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXE315.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXE315.internal_condition">
      <require condition="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition">
      <accept condition="allOf.component.lpspi_adapter, driver.lpspi.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpspi_adapter, driver.lpspi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MCXE315.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.lpuart_adapter, device=MCXE315.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device=MCXE315.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXE315.internal_condition"/>
    </condition>
