vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE315_DFP.pdsc
    <component Cclass="ele_hseb_interface" Cgroup="ele_hseb" Cversion="1.0.0" condition="component.ele_hseb_interface.condition_id">
      <description>Component ele_hseb_interface</description>
      <files>
        <file category="header" name="components/ele_hseb/interface/hse_gpr_status.h" projectpath="component/ele_hseb/interface"/>
        <file category="header" name="components/ele_hseb/interface/hse_interface.h" projectpath="component/ele_hseb/interface"/>
        <file category="header" name="components/ele_hseb/interface/hse_srv_responses.h" projectpath="component/ele_hseb/interface"/>
        <file category="header" name="components/ele_hseb/interface/hse_status_and_errors.h" projectpath="component/ele_hseb/interface"/>
        <file category="header" name="components/ele_hseb/interface/std_typedefs.h" projectpath="component/ele_hseb/interface"/>
        <file category="header" name="components/ele_hseb/interface/config/hse_b_config.h" projectpath="component/ele_hseb/interface/config"/>
        <file category="header" name="components/ele_hseb/interface/config/hse_compile_defs.h" projectpath="component/ele_hseb/interface/config"/>
        <file category="header" name="components/ele_hseb/interface/config/hse_compiler_abs.h" projectpath="component/ele_hseb/interface/config"/>
        <file category="header" name="components/ele_hseb/interface/config/hse_platform.h" projectpath="component/ele_hseb/interface/config"/>
        <file category="header" name="components/ele_hseb/interface/config/hse_target.h" projectpath="component/ele_hseb/interface/config"/>
        <file category="header" name="components/ele_hseb/interface/inc_common/hse_common_types.h" projectpath="component/ele_hseb/interface/inc_common"/>
        <file category="header" name="components/ele_hseb/interface/inc_common/hse_defs.h" projectpath="component/ele_hseb/interface/inc_common"/>
        <file category="header" name="components/ele_hseb/interface/inc_common/hse_keymgmt_common_types.h" projectpath="component/ele_hseb/interface/inc_common"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_aead.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_attr.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_bootdatasig.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_cmac_with_counter.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_combined_auth_enc.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_crc32.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_firmware_update.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_hash.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_ipsec.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_key_derive.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_key_generate.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_key_import_export.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_key_mgmt_utils.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_mac.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_monotonic_cnt.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_msc_key_mgmt.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_otfad_install.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_publish_sys_img.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_random.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_rsa_cipher.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_sbaf_update.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_self_test.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_she_cmds.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_sign.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_siphash.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_smr_install.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_sym_cipher.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_sys_authorization.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_tmu_reg_config.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="header" name="components/ele_hseb/interface/inc_services/hse_srv_utils.h" projectpath="component/ele_hseb/interface/inc_services"/>
        <file category="include" name="components/ele_hseb/"/>
        <file category="include" name="components/ele_hseb/interface/"/>
        <file category="include" name="components/ele_hseb/interface/config/"/>
        <file category="include" name="components/ele_hseb/interface/inc_common/"/>
        <file category="include" name="components/ele_hseb/interface/inc_services/"/>
      </files>
    </component>
    <component Cclass="ele_hseb_mu_driver" Cgroup="ele_hseb" Cversion="1.0.0" condition="component.ele_hseb_mu_driver.condition_id">
      <description>Component ele_hseb_mu_driver</description>
      <files>
        <file category="sourceC" name="components/ele_hseb/drivers/mu/hse_mu.c" projectpath="component/ele_hseb/drivers/mu"/>
        <file category="header" name="components/ele_hseb/drivers/mu/hse_mu.h" projectpath="component/ele_hseb/drivers/mu"/>
        <file category="include" name="components/ele_hseb/"/>
        <file category="include" name="components/ele_hseb/drivers/mu/"/>
      </files>
    </component>
    <component Cclass="ele_hseb_services" Cgroup="ele_hseb" Cversion="1.0.0" condition="component.ele_hseb_services.condition_id">
      <description>Component ele_hseb_services</description>
      <files>
        <file category="header" name="components/ele_hseb/services/inc/global_defs.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_config.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_demo_app_services.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_global_types.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_global_variables.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_host_boot.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_host_common.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_host_flashSrv.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_host_sys_authorization.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_host_test.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_host_wrappers.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_memory_update_protocol.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_monotonic_cnt.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_sbaf_update.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_she_api.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/hse_she_commands.h" projectpath="component/ele_hseb/services/inc"/>
        <file category="header" name="components/ele_hseb/services/inc/standard/hse_b_catalog_formatting.h" projectpath="component/ele_hseb/services/inc/standard"/>
        <file category="sourceC" name="components/ele_hseb/services/src/common/hse_config.c" projectpath="component/ele_hseb/services/src/common"/>
        <file category="sourceC" name="components/ele_hseb/services/src/common/hse_global_variables.c" projectpath="component/ele_hseb/services/src/common"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/hse_crypto.c" projectpath="component/ele_hseb/services/src/fw_crypto"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_aead_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_aes_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_BD_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_ecc_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_fastcmac_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_get_key_info.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_hash_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_host_Kdf_examples.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_host_km_import_key.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_host_km_utils.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_host_msc_km.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_publish_keystore_RamToFlash_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_rsa_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_sessionkeys_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_sys_auth_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="header" name="components/ele_hseb/services/src/fw_crypto/inc/hse_UpdateNvmKeys_example.h" projectpath="component/ele_hseb/services/src/fw_crypto/inc"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_aead_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_aes_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_BurchesmesterDesmt_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_ecc_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_fastcmac_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_get_key_info.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_hash_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_host_Kdf_examples.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_host_km_import_key.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_host_km_utils.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_host_sys_authorization.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_publish_keystore_RamToFlash_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_rsa_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_sessionkeys_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_sys_auth_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/fw_crypto/src/hse_UpdateNvmKeys_example.c" projectpath="component/ele_hseb/services/src/fw_crypto/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/hse_b_catalog_formatting.c" projectpath="component/ele_hseb/services/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/hse_demo_app_config.c" projectpath="component/ele_hseb/services/src"/>
        <file category="sourceC" name="components/ele_hseb/services/src/monotonic_cnt/hse_monotonic_cnt.c" projectpath="component/ele_hseb/services/src/monotonic_cnt"/>
        <file category="sourceC" name="components/ele_hseb/services/src/sbaf_update/sbaf_update.c" projectpath="component/ele_hseb/services/src/sbaf_update"/>
        <file category="sourceC" name="components/ele_hseb/services/src/shecommandapp/hse_host_common.c" projectpath="component/ele_hseb/services/src/shecommandapp"/>
        <file category="sourceC" name="components/ele_hseb/services/src/shecommandapp/hse_host_test.c" projectpath="component/ele_hseb/services/src/shecommandapp"/>
        <file category="sourceC" name="components/ele_hseb/services/src/shecommandapp/hse_host_wrappers.c" projectpath="component/ele_hseb/services/src/shecommandapp"/>
        <file category="sourceC" name="components/ele_hseb/services/src/shecommandapp/hse_memory_update_protocol.c" projectpath="component/ele_hseb/services/src/shecommandapp"/>
        <file category="sourceC" name="components/ele_hseb/services/src/shecommandapp/hse_she_command_main.c" projectpath="component/ele_hseb/services/src/shecommandapp"/>
        <file category="sourceC" name="components/ele_hseb/services/src/shecommandapp/hse_she_commands.c" projectpath="component/ele_hseb/services/src/shecommandapp"/>
        <file category="sourceC" name="components/ele_hseb/services/src/standard/hse_fwType_config.c" projectpath="component/ele_hseb/services/src/standard"/>
        <file category="sourceC" name="components/ele_hseb/services/src/utest/hse_utest.c" projectpath="component/ele_hseb/services/src/utest"/>
        <file category="include" name="components/ele_hseb/"/>
        <file category="include" name="components/ele_hseb/services/inc/"/>
        <file category="include" name="components/ele_hseb/services/inc/standard/"/>
        <file category="include" name="components/ele_hseb/services/src/fw_crypto/inc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash_nor_lpspi" Cversion="1.0.0" condition="component.flash_nor_lpspi.condition_id">
      <description>Component flash_nor_lpspi</description>
      <files>
        <file category="header" name="components/flash/nor/fsl_nor_flash.h" projectpath="nor_flash/nor"/>
        <file category="sourceC" name="components/flash/nor/lpspi/fsl_lpspi_nor_flash.c" projectpath="nor_flash/nor/lpspi"/>
        <file category="header" name="components/flash/nor/lpspi/fsl_lpspi_nor_flash.h" projectpath="nor_flash/nor/lpspi"/>
        <file category="sourceC" name="components/flash/nor/lpspi/fsl_lpspi_mem_adapter.c" projectpath="nor_flash/nor/lpspi"/>
        <file category="header" name="components/flash/nor/lpspi/fsl_lpspi_mem_adapter.h" projectpath="nor_flash/nor/lpspi"/>
        <file category="include" name="components/flash/nor/"/>
        <file category="include" name="components/flash/nor/lpspi/"/>
      </files>
    </component>
