vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE315_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_imx8" Cversion="2.0.0" condition="component.silicon_id_imx8.condition_id">
      <description>Driver silicon_id imx8</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imx8/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_imx93" Cversion="2.0.0" condition="component.silicon_id_imx93.condition_id">
      <description>Driver silicon_id imx93</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imx93/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt10xx" Cversion="2.0.0" condition="component.silicon_id_imxrt10xx.condition_id">
      <description>Driver silicon_id rt10xx</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/rt10xx/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt1170" Cversion="2.0.0" condition="component.silicon_id_imxrt1170.condition_id">
      <description>Driver silicon_id imxrt1170</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imxrt1170/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt1180" Cversion="2.0.0" condition="component.silicon_id_imxrt1180.condition_id">
      <description>Driver silicon_id imxrt1180</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imxrt1180/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxe31x" Cversion="2.0.0" condition="component.silicon_id_mcxe31x.condition_id">
      <description>Driver silicon_id mcxe31x</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/mcxe31x/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxn" Cversion="2.0.0" condition="component.silicon_id_mcxn.condition_id">
      <description>Driver silicon_id mcxn</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/mcxn/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rw610" Cversion="2.0.0" condition="component.silicon_id_rw610.condition_id">
      <description>Driver silicon_id rw610</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/rw610/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_scfw" Cversion="2.0.0" condition="component.silicon_id_scfw.condition_id">
      <description>Driver silicon_id scfw</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/scfw/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_crc_adapter" Cversion="1.0.0" condition="component.software_crc_adapter.condition_id">
      <description>Component software_crc_adapter</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h" projectpath="component/crc"/>
        <file category="sourceC" name="components/crc/fsl_adapter_software_crc.c" projectpath="component/crc"/>
        <file category="include" name="components/crc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter" Cversion="1.0.0" condition="component.software_rng_adapter.condition_id">
      <description>Component software_rng_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_software_rng.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter" Cversion="2.2.0" condition="component.tfa9896_adapter.condition_id">
      <description>Component tfa9896 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/tfa9896/fsl_codec_tfa9896_adapter.h" projectpath="codec/port/tfa9896"/>
        <file category="sourceC" name="components/codec/port/tfa9896/fsl_codec_tfa9896_adapter.c" projectpath="codec/port/tfa9896"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/tfa9896/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter" Cversion="2.2.0" condition="component.tfa9xxx_adapter.condition_id">
      <description>Component tfa9xxx adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/tfa9xxx/fsl_codec_tfa9xxx_adapter.h" projectpath="codec/port/tfa9xxx"/>
        <file category="sourceC" name="components/codec/port/tfa9xxx/fsl_codec_tfa9xxx_adapter.c" projectpath="codec/port/tfa9xxx"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/tfa9xxx/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXE315_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXE315_cmsis</description>
      <files>
        <file category="header" name="devices/MCXE315/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXE315/MCXE315.h" projectpath="device"/>
        <file category="header" name="devices/MCXE315/MCXE315_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXE315/MCXE315_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_ADC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_BCTU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_CAN.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_CMU_FC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_CMU_FM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_CONFIGURATION.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_CRC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_DCM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_DCM_GPR.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_DMA.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_DMAMUX.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_EIM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_EMIOS.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_ERM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_FCCU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_FIRC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_FLASH.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_FLEXIO.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_FXOSC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_INTM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_JDC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_LCU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_LPCMP.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_LPI2C.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_LPSPI.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_LPUART.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_MCM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_MC_CGM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_MC_ME.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_MC_RGM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_MDM_AP.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_MSCM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_MU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_PFLASH.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_PIT.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_PLL.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_PMC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_PRAMC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_RTC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_SDA_AP.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_SIRC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_SIUL2.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_STCU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_STM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_SWT.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_TEMPSENSE.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_TRGMUX.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_TSPC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_VIRT_WRAPPER.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_WKPU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_XBIC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE315/periph5/PERI_XRDC.h" projectpath="device/periph5"/>
        <file category="include" name="devices/MCXE315/"/>
        <file category="include" name="devices/MCXE315/periph5/"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="MCXE315_flash" Cversion="1.0.0" condition="device.MCXE315_flash.condition_id">
      <description>Device MCXE315_flash</description>
      <files>
        <file category="doc" name="devices/MCXE315/mcuxpresso/device.MCXE315_flash_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="doc" name="devices/MCXE315/template/device.RTE_dummy.txt"/>
        <file category="include" name="devices/MCXE315/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXE315_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXE315_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXE315.condition_id" category="linkerScript" attr="config" name="devices/MCXE315/arm/MCXE315_flash.scf" version="1.0.0" projectpath="MCXE315/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXE315.condition_id" category="linkerScript" attr="config" name="devices/MCXE315/arm/MCXE315_ram.scf" version="1.0.0" projectpath="MCXE315/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXE315.condition_id" category="linkerScript" attr="config" name="devices/MCXE315/gcc/MCXE315_flash.ld" version="1.0.0" projectpath="MCXE315/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXE315.condition_id" category="linkerScript" attr="config" name="devices/MCXE315/gcc/MCXE315_ram.ld" version="1.0.0" projectpath="MCXE315/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXE315.condition_id" category="linkerScript" attr="config" name="devices/MCXE315/iar/MCXE315_flash.icf" version="1.0.0" projectpath="MCXE315/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXE315.condition_id" category="linkerScript" attr="config" name="devices/MCXE315/iar/MCXE315_ram.icf" version="1.0.0" projectpath="MCXE315/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXE315" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXE315</description>
      <files>
        <file category="header" attr="config" name="devices/MCXE315/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXE315/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXE315/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXE315/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXE315/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXE315/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXE315/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXE315/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXE315/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXE315_startup</description>
      <files>
        <file condition="allOf.toolchains=armgcc, iar, mdk.condition_id" category="sourceC" attr="config" name="devices/MCXE315/startup_MCXE315.c" version="1.0.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXE315_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXE315_system</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/system_MCXE315.c" projectpath="device"/>
        <file category="header" name="devices/MCXE315/system_MCXE315.h" projectpath="device"/>
        <file category="include" name="devices/MCXE315/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="bctu" Cversion="2.1.0" condition="driver.bctu.condition_id">
      <description>bctu Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_bctu.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_bctu.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7" Cversion="2.0.4" condition="driver.cache_armv7_m7.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common" Cversion="1.0.0" condition="driver.camera-common.condition_id">
      <description>Driver camera-common</description>
      <files>
        <file category="header" name="components/video/camera/fsl_camera.h" projectpath="video"/>
        <file category="include" name="components/video/camera/"/>
      </files>
    </component>
