vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE315_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ap1302" Cversion="1.0.1" condition="driver.camera-device-ap1302.condition_id">
      <description>Driver camera-device-ap1302</description>
      <files>
        <file category="header" name="components/video/camera/device/ap1302/fsl_ap1302.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ap1302/fsl_ap1302.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ap1302/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common" Cversion="1.0.0" condition="driver.camera-device-common.condition_id">
      <description>Driver camera-device-common</description>
      <files>
        <file category="header" name="components/video/camera/device/fsl_camera_device.h" projectpath="video"/>
        <file category="include" name="components/video/camera/device/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-max9286" Cversion="1.0.2" condition="driver.camera-device-max9286.condition_id">
      <description>Driver camera-device-max9286</description>
      <files>
        <file category="header" name="components/video/camera/device/max9286/fsl_max9286.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/max9286/fsl_max9286.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/max9286/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-mt9m114" Cversion="1.0.2" condition="driver.camera-device-mt9m114.condition_id">
      <description>Driver camera-device-mt9m114</description>
      <files>
        <file category="header" name="components/video/camera/device/mt9m114/fsl_mt9m114.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/mt9m114/fsl_mt9m114.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/mt9m114/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov5640" Cversion="1.0.1" condition="driver.camera-device-ov5640.condition_id">
      <description>Driver camera-device-ov5640</description>
      <files>
        <file category="header" name="components/video/camera/device/ov5640/fsl_ov5640.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov5640/fsl_ov5640.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov5640/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7670" Cversion="1.0.2" condition="driver.camera-device-ov7670.condition_id">
      <description>Driver camera-device-ov7670</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7670/fsl_ov7670.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7670/fsl_ov7670.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7670/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7725" Cversion="1.0.1" condition="driver.camera-device-ov7725.condition_id">
      <description>Driver camera-device-ov7725</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7725/fsl_ov7725.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7725/fsl_ov7725.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7725/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb" Cversion="1.0.1" condition="driver.camera-device-sccb.condition_id">
      <description>Driver camera-device-sccb</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/video/camera/device/sccb/fsl_sccb.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/sccb/fsl_sccb.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/sccb/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-receiver-common" Cversion="1.0.0" condition="driver.camera-receiver-common.condition_id">
      <description>Driver camera-receiver-common</description>
      <files>
        <file category="header" name="components/video/camera/receiver/fsl_camera_receiver.h" projectpath="video"/>
        <file category="include" name="components/video/camera/receiver/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.2" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.6.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXE315/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE315/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.12.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXE315/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE315/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXE315/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE315/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmu_fc" Cversion="2.0.1" condition="driver.cmu_fc.condition_id">
      <description>cmu_fc Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_cmu_fc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_cmu_fc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmu_fm" Cversion="2.0.1" condition="driver.cmu_fm.condition_id">
      <description>cmu_fm Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_cmu_fm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_cmu_fm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
