vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE315_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxls8974cf" Cversion="1.0.0" condition="driver.fxls8974cf.condition_id">
      <description>Driver fxls8974cf</description>
      <files>
        <file category="header" name="components/sensor/fxls8974cf/fsl_fxls.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxls8974cf/fsl_fxls.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxls8974cf/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/sensor/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="htu21d" Cversion="1.0.0" condition="driver.htu21d.condition_id">
      <description>Driver htu21d</description>
      <files>
        <file category="header" name="components/sensor/htu21d/fsl_htu21d.h" projectpath="htu"/>
        <file category="sourceC" name="components/sensor/htu21d/fsl_htu21d.c" projectpath="htu"/>
        <file category="include" name="components/sensor/htu21d/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="icm42688p" Cversion="1.0.0" condition="driver.icm42688p.condition_id">
      <description>Driver icm42688p</description>
      <files>
        <file category="header" name="components/sensor/icm42688p/fsl_icm42688p.h" projectpath="icm42688p"/>
        <file category="sourceC" name="components/sensor/icm42688p/fsl_icm42688p.c" projectpath="icm42688p"/>
        <file category="include" name="components/sensor/icm42688p/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ili9341" Cversion="1.0.2" condition="driver.ili9341.condition_id">
      <description>Driver ili9341</description>
      <files>
        <file category="header" name="components/display/ili9341/fsl_ili9341.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ili9341/fsl_ili9341.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ili9341/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="intm" Cversion="2.1.0" condition="driver.intm.condition_id">
      <description>INTM Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_intm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_intm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lcu" Cversion="2.0.0" condition="driver.lcu.condition_id">
      <description>lcu Driver</description>
      <files>
        <file category="header" name="devices/MCXE315/drivers/fsl_lcu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_lcu.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpcmp" Cversion="2.3.2" condition="driver.lpcmp.condition_id">
      <description>LPCMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_lpcmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_lpcmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.6.2" condition="driver.lpi2c.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_lpi2c.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_lpi2c.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma" Cversion="2.4.4" condition="driver.lpi2c_edma.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_lpi2c_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_lpi2c_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi" Cversion="2.7.3" condition="driver.lpspi.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_lpspi.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE315/drivers/fsl_lpspi.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.4.9" condition="driver.lpspi_edma.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="header" name="devices/MCXE315/drivers/fsl_lpspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_lpspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.10.0" condition="driver.lpuart.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MCXE315/drivers/fsl_lpuart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE315/drivers/fsl_lpuart.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE315/drivers/"/>
      </files>
    </component>
